In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('carpricetraining.csv')

In [3]:
df.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [4]:
df.sample()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
3949,3949,Ford Figo Diesel ZXI,Kolkata,2013,22000,Diesel,Manual,First,20.0 kmpl,1399 CC,68 bhp,5.0,NaN,2.25

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         6019 non-null   int64
 1   Name               6019 non-null   object
 2   Location           6019 non-null   object
 3   Year               6019 non-null   int64
 4   Kilometers_Driven  6019 non-null   int64
 5   Fuel_Type          6019 non-null   object
 6   Transmission       6019 non-null   object
 7   Owner_Type         6019 non-null   object
 8   Mileage            6017 non-null   object
 9   Engine             5983 non-null   object
 10  Power              5983 non-null   object
 11  Seats              5977 non-null   float64
 12  New_Price          824 non-null    object
 13  Price              6019 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 658.5+ KB

In [6]:
df2=df.drop('Unnamed: 0', axis=1, inplace=False)

In [7]:
df2.sample()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
2165,Audi A6 2011-2015 2.0 TDI Premium Plus,Coimbatore,2014,66882,Diesel,Automatic,First,17.68 kmpl,1968 CC,174.33 bhp,5.0,NaN,25.02

In [8]:
df.sample()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
4668,4668,Hyundai Creta 1.6 CRDi SX,Delhi,2017,44000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.5

In [9]:
df.drop('Unnamed: 0', axis=1, inplace=True)

In [10]:
df.sample()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
5358,Honda City i VTEC V,Hyderabad,2016,29512,Petrol,Manual,First,17.4 kmpl,1497 CC,117.3 bhp,5.0,NaN,7.9

In [11]:
df.drop('New_Price', axis=1, inplace=True)

In [12]:
df.sample()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
5467,Maruti Zen Estilo 1.1 LX BSIII,Mumbai,2010,23000,Petrol,Manual,First,18.2 kmpl,1061 CC,64 bhp,5.0,1.9

In [13]:
model_names = df['Name'].unique()

In [14]:
model_names

array(['Maruti Wagon R LXI CNG', 'Hyundai Creta 1.6 CRDi SX Option',
       'Honda Jazz V', ..., 'Volkswagen Polo IPL II 1.2 Petrol Highline',
       'Tata Bolt Revotron XT', 'Mahindra Xylo D4 BSIV'], dtype=object)

In [15]:
car_names=df['Name'].str.split(' ', expand=True)

In [18]:
car_companies , car_model = car_names[0], car_names[1]

In [20]:
df['Car_Companies'], df['Car_model'] = car_companies, car_model

In [21]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti,Wagon
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,Creta
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,Jazz
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,Ertiga
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,A4

In [23]:
df.drop(['Name'], axis=1,inplace=True)

In [24]:
df.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,Creta
2,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,Jazz
3,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,Ertiga
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,A4

In [25]:
df['Car_model'] = df['Car_model'].apply(lambda x : x.lower())

In [26]:
df.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti,wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,creta
2,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,jazz
3,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,ertiga
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,a4

In [28]:
df.drop(['Year', 'Kilometers_Driven', 'Owner_Type'], axis=1, inplace=True)

In [29]:
df.head()

,Location,Fuel_Type,Transmission,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Mumbai,CNG,Manual,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti,wagon
1,Pune,Diesel,Manual,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,creta
2,Chennai,Petrol,Manual,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,jazz
3,Chennai,Diesel,Manual,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,ertiga
4,Coimbatore,Diesel,Automatic,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,a4

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Location       6019 non-null   object
 1   Fuel_Type      6019 non-null   object
 2   Transmission   6019 non-null   object
 3   Mileage        6017 non-null   object
 4   Engine         5983 non-null   object
 5   Power          5983 non-null   object
 6   Seats          5977 non-null   float64
 7   Price          6019 non-null   float64
 8   Car_Companies  6019 non-null   object
 9   Car_model      6019 non-null   object
dtypes: float64(2), object(8)
memory usage: 470.4+ KB

In [35]:
def convert_to_number(x):
    res = ''
    for char in x:
        if char.isdigit() or char =='.':
            res += char
    try :
        return float(res)
    except :
        return None

convert_to_number('998 CC')

998.0

In [32]:
df['Engine']

0        998 CC
1       1582 CC
2       1199 CC
3       1248 CC
4       1968 CC
         ...
6014    1248 CC
6015    1120 CC
6016    2498 CC
6017     998 CC
6018     936 CC
Name: Engine, Length: 6019, dtype: object

In [39]:
df['Engine'] = df['Engine'].apply(lambda x : convert_to_number(str(x)))

In [40]:
df['Mileage'] = df['Mileage'].apply(lambda x : convert_to_number(str(x)))

In [41]:
df['Power'] = df['Power'].apply(lambda x : convert_to_number(str(x)))

In [42]:
df.head()

,Location,Fuel_Type,Transmission,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Mumbai,CNG,Manual,26.60,998.0,58.16,5.0,1.75,Maruti,wagon
1,Pune,Diesel,Manual,19.67,1582.0,126.20,5.0,12.50,Hyundai,creta
2,Chennai,Petrol,Manual,18.20,1199.0,88.70,5.0,4.50,Honda,jazz
3,Chennai,Diesel,Manual,20.77,1248.0,88.76,7.0,6.00,Maruti,ertiga
4,Coimbatore,Diesel,Automatic,15.20,1968.0,140.80,5.0,17.74,Audi,a4